
<script setup>
  import { useMetaTag } from "@/composables/index.js";
  import ENV from "@/config/env.js";

  const { setTitle } = useMetaTag();
  setTitle("利用規約");

  const prefix = ENV.APP_PREFIX;
  const classWrapper = {
    [`${prefix}-legal-wrapper`]: true,
  };
</script>

<template>
  <main :class="classWrapper">
    <div class="wrapper-inner">
      <p>
        本規約は、一般社団法人竹芝エリアマネジメントおよび東急不動産株式会社（以下「サービス提供者」という。）
        がこのウェブサイト上で提供するサービス（以下「本サービス」という。）
        に適用されます。本サービスの利用者(以下、「ユーザー」という。)
        は、本規約に従って、本サービスをご利用いただきます。
      </p>

      <h2>第１条：目的</h2>
      <p>
        本サービスは、利用者に対して、主に竹芝地区において災害時又は災害に備える為に利用できる機能及び情報等を提供することを目的としています。
      </p>

      <h2>第２条：運用管理等</h2>
      <p>
        本サービスは、サービス提供者が管理者として運用管理します。なお、サービス提供者は、
        サービス運用をソフトバンク株式会社（以下「サービス運営会社」という。）へ委託しており、
        サービス運営会社は、お客さまの利用者情報を「<a href="/legal/privacy-policy">アプリケーションプライバシーポリシー</a>」
        に定めるところにより取り扱います。
      </p>

      <h2>第３条：サービスの概要</h2>
      <p>
        本サービスは、防災関連情報、気象・地震情報、電車運行情報、SNS災害投稿情報等を提供するものです。
      </p>

      <h2>第４条：サービス利用にあたっての留意事項</h2>
      <p>
        本サービスの利用について、利用者は次の事項に留意することとします。<br>
        本サービスが提供又は連携しているサービスについて、利用者は、自己の判断において利用することとします。
        また、利用に当たっては、当該サービスの利用規約を遵守し利用してください。
      </p>

      <h2>第５条：利用環境</h2>
      <p>
        本サービスは、全ての利用環境に対して完全な動作を保証するものではありません。
        利用者の環境や利用する機器によって、一部又は全部の機能が利用できない場合があります。
      </p>

      <h2>第６条：免責事項</h2>
      <p>
        本サービスの利用及びサービス提供の停止によって生じたトラブルやその他の損害について、サービス提供者は、
        自らの責に帰すべき事由がないかぎり、一切の責任を負いません。また、正確な情報提供に努めますが、
        緊急又は流動的な情報等に関して、完全性、確実性及び有用性を保証するものではありません。
        これらの情報等を利用して生じた利用者又は第三者の損害に対して、サービス提供者は一切の責任を負いません。
      </p>

      <h2>第７条：サービスの停止・廃止および変更等</h2>
      <p>
        １. サービス提供者は、次の各号のいずれかに該当する場合には、本サービスの提供を一時停止することがあります。<br>
        (1)設備の保守、点検、故障対応を行うとき。<br>
        (2)地震、落雷、台風、津波等の天災地変、火災、停電、感染症、争乱、法令の改正、
        行政機関または司法機関による処分その他不可抗力により、本サービスの提供が困難になったとき。<br>
        (3)システム障害（本サービスに関連する他社システム及びサービスの停止または廃止を含む）が発生したとき。<br>
        (4)輻輳、帯域の逼迫、その他通信回線の不具合が発生したとき。<br>
        (5)設備に過大な負荷が発生したとき。<br>
        (6)その他、サービス提供者が本サービスの提供が困難と判断したとき。<br><br>
        ２.サービス提供者は、本サービスの停止に定める事由により本サービスの継続的な提供が困難であると判断した場合、
        本サービスを廃止することがあります。<br><br>
        ３.サービス提供者は、本サービスの内容の全部もしくは一部の変更を、通知なく実施する場合があります。
      </p>

      <h2>第８条：利用規約の改訂</h2>
      <p>
        本規約は、サービス提供者の判断で改訂される場合があります。
        規約が改訂された場合は、本サービス上に掲載した時から改訂後の内容が適用されます。
      </p>

      <h2>第９条：費用</h2>
      <p>
        本サービスは無料で利用できますが、通信料は利用者の負担となります。
      </p>

      <h2>第１０条：禁止事項</h2>
      <p>
        利用者が次の行為をすることを禁止します。また、悪質な場合には法的措置をとる場合があります。<br><br>
        ・有害なコンピュータプログラムを送信し、又は書き込む行為<br>
        ・本サービスの運営を妨害し、又は信用を毀損する行為<br>
        ・法令又は公序良俗に違反する行為又はそのおそれのある行為<br>
        ・他人の権利又は財産若しくは人格的利益を侵害する行為<br>
        ・その他サービス提供者が不適当と認める行為
      </p>

      <h2>第１１条：配信遅延、中断、不着、文字化け等</h2>
      <p>
        通信機器の状態や回線、サーバーの混雑等による配信遅延、中断、不着、
        文字化けなどにより生じたすべての結果について、サービス提供者は、一切の責任を負いません。
        また、再通知原因に関する調査等の求めに応じることはできません。
      </p>

      <h2>第１２条：サービスの停止等</h2>
      <p>
        本サービスのシステムに異常が生じた場合は、予告なくサービスを停止することがあります。
        これにより生じた利用者及び第三者の損害に対して、サービス提供者は、自らの責に帰すべき事由がないかぎり、
        一切の責任を負いません。
      </p>

      <h2>第１３条：知的財産権</h2>
      <p>
        本サービスで提供されているコンテンツの著作権その他の知的財産権は、
        原則としてサービス提供者又は<br>サービス運営会社および、サービス提供者又はサービス運営会社に利用許諾する第三者が保有しており、
        その扱いは日本国の著作権法その他の知的財産に関する法律に従います。また、
        本サービス内で使用している著作物で権利者の表記があるものは、当該表記によります。
      </p>

      <h2>第１４条：分離可能性</h2>
      <p>
        本規約のいずれかの条項またはその一部が、民法、消費者契約法その他の法令等により無効または執行不能と判断された場合であっても、本規約の残りの部分は、
        継続して完全な効力を有するものとします。<br>以上
      </p>
    </div>
  </main>
</template>

<style lang="scss" scoped>
  @import "@/assets/scss/theme/default/term";
</style>